/*Создать массив [5][7]. Инициализируем числами от 0 до 35:
a) при помощи списка инициализаторов;
b) в цикле ;
c) с использованием вложенного цикла.*/

#include<stdio.h>

int main()
{
	int i,j,k;
	int mas1[5][7] = {{0,1,2,3,4,5,6},{7,8,9,10,11,12,13},{14,15,16,17,18,19,20},
										{21,22,23,24,25,26,27},{28,29,30,31,32,33,34}};
	int mas2[5][7];
	
	k = 0;
	for(i=0;i<5;i++)
	{
		for(j=0;j<7;j++)
		{
  		mas2[i][j] = k;
			k++;
		}
	}

	for(i=0;i<5;i++)
	{
		printf("{");
		for(j=0;j<7;j++)
		{
  		printf("%d ",mas2[i][j]);
		}
		printf("} ");
	}
	printf("\n");

	return 0;
}
